In [1]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [2]:
df = pd.read_csv("../data/ASET_BANGUNAN_AIR.csv", sep='|', encoding='ISO-8859-1')

In [3]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,TGL_PSP,JUMLAH_FOTO,JUMLAH_KIB,STATUS_PENGELOLAAN,STATUS_PENGGUNAAN,JENIS_PENGGUNA,KD_SATKER_PENGGUNA,UR_SATKER_PENGGUNA,ALAMAT_SATKER_PENGGUNA,TGL_TARIK
0,60,KEPOLISIAN NEGARA RI,7104,KPKNL JAKARTA IV,060010100642012000KD,DIREKTORAT LALU LINTAS POLDA METRO JAYA,060010100642012000KD,DIREKTORAT LALU LINTAS POLDA METRO JAYA,BANGUNAN AIR KOTOR,BANGUNAN PENGAMAN AIR KOTOR,...,NaN,0,0.0,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
1,60,KEPOLISIAN NEGARA RI,8103,KPKNL BOGOR,060010100642051000KD,SPN POLDA METRO JAYA,060010100642051000KD,SPN POLDA METRO JAYA,BANGUNAN AIR BERSIH/AIR BAKU,BANGUNAN WADUK AIR BERSIH/AIR BAKU,...,NaN,0,0.0,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
2,60,KEPOLISIAN NEGARA RI,9101,KPKNL SEMARANG,060010300643518000KD,POLRES JEPARA,060010300643518000KD,POLRES JEPARA,BANGUNAN AIR BERSIH/AIR BAKU,BANGUNAN WADUK AIR BERSIH/AIR BAKU,...,NaN,0,0.0,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
3,60,KEPOLISIAN NEGARA RI,9102,KPKNL SURAKARTA,060010300643607000KD,KEPOLISIAN RESOR WONOGIRI,060010300643607000KD,KEPOLISIAN RESOR WONOGIRI,BANGUNAN AIR KOTOR,BANGUNAN PEMBUANG AIR KOTOR,...,NaN,0,0.0,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226
4,60,KEPOLISIAN NEGARA RI,9102,KPKNL SURAKARTA,060010300643607000KD,KEPOLISIAN RESOR WONOGIRI,060010300643607000KD,KEPOLISIAN RESOR WONOGIRI,BANGUNAN AIR KOTOR,BANGUNAN PEMBUANG AIR KOTOR,...,NaN,0,0.0,NaN,Digunakan sendiri untuk operasional,NaN,NaN,NaN,NaN,20200226

In [4]:
len(df)

676

In [5]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP', 'NO_KIB',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA',
       'NILAI_PEROLEHAN_PERTAMA', 'NILAI_MUTASI', 'NILAI_PEROLEHAN',
       'NILAI_PENYUSUTAN', 'NILAI_BUKU', 'KONDISI', 'MERK', 'KUANTITAS',
       'NO_DANA', 'TGL_DANA', 'DARI', 'ASL_PERLH', 'TGL_PERLH', 'LUAS_DASAR',
       'LUAS_BANGUNAN', 'NO_PSP', 'TGL_PSP', 'JUMLAH_FOTO', 'JUMLAH_KIB',
       'STATUS_PENGELOLAAN', 'STATUS_PENGGUNAAN', 'JENIS_PENGGUNA',
       'KD_SATKER_PENGGUNA', 'UR_SATKER_PENGGUNA', 'ALAMAT_SATKER_PENGGUNA',
       'TGL_TARIK'],
      dtype='object')

In [6]:
# df['NO_KIB']

In [7]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA', 'TGL_DANA', 'TGL_PERLH', 'TGL_PSP', 
         'TGL_TARIK']

In [23]:
df[cname[7]]

0      20200226
1      20200226
2      20200226
3      20200226
4      20200226
         ...
671    20200226
672    20200226
673    20200226
674    20200226
675    20200226
Name: TGL_TARIK, Length: 676, dtype: int64

In [9]:
df[cname[0]]

0      2012-10-28 00:00:00.0000000
1      1987-01-02 00:00:00.0000000
2      2003-03-02 00:00:00.0000000
3      1995-10-20 00:00:00.0000000
4      1985-08-24 00:00:00.0000000
                  ...
671    1980-12-31 00:00:00.0000000
672    1989-10-18 00:00:00.0000000
673    1980-12-31 00:00:00.0000000
674    1995-10-20 00:00:00.0000000
675    1980-12-31 00:00:00.0000000
Name: TANGGAL_PEROLEHAN, Length: 676, dtype: object

In [10]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0      2012-10-28
1      1987-01-02
2      2003-03-02
3      1995-10-20
4      1985-08-24
          ...
671    1980-12-31
672    1989-10-18
673    1980-12-31
674    1995-10-20
675    1980-12-31
Name: TANGGAL_PEROLEHAN, Length: 676, dtype: object

In [11]:
df[cname[1]]

0      2012-12-24 00:00:00.0000000
1      2018-05-31 00:00:00.0000000
2      2018-02-22 00:00:00.0000000
3      2018-06-22 00:00:00.0000000
4      2018-06-22 00:00:00.0000000
                  ...
671    2017-12-28 00:00:00.0000000
672    2018-06-22 00:00:00.0000000
673    2017-12-28 00:00:00.0000000
674    2018-06-22 00:00:00.0000000
675    2017-11-24 00:00:00.0000000
Name: TGL_BUKU, Length: 676, dtype: object

In [12]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0      2012-12-24
1      2018-05-31
2      2018-02-22
3      2018-06-22
4      2018-06-22
          ...
671    2017-12-28
672    2018-06-22
673    2017-12-28
674    2018-06-22
675    2017-11-24
Name: TGL_BUKU, Length: 676, dtype: object

In [13]:
df[cname[2]]

0      2012-12-24 00:00:00.0000000
1      2018-05-31 00:00:00.0000000
2      2018-02-22 00:00:00.0000000
3      2018-06-22 00:00:00.0000000
4      2018-06-22 00:00:00.0000000
                  ...
671    2017-12-28 00:00:00.0000000
672    2018-06-22 00:00:00.0000000
673    2017-12-28 00:00:00.0000000
674    2018-06-22 00:00:00.0000000
675    2017-11-24 00:00:00.0000000
Name: TGL_REKAM, Length: 676, dtype: object

In [14]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0      2012-12-24
1      2018-05-31
2      2018-02-22
3      2018-06-22
4      2018-06-22
          ...
671    2017-12-28
672    2018-06-22
673    2017-12-28
674    2018-06-22
675    2017-11-24
Name: TGL_REKAM, Length: 676, dtype: object

In [15]:
df[cname[3]]

0      2012-12-24 00:00:00.0000000
1      2007-12-31 00:00:00.0000000
2      2007-04-16 00:00:00.0000000
3      2007-12-31 00:00:00.0000000
4      2007-12-31 00:00:00.0000000
                  ...
671    2010-03-10 00:00:00.0000000
672    2007-12-31 00:00:00.0000000
673    2010-03-10 00:00:00.0000000
674    2007-12-31 00:00:00.0000000
675    2010-03-10 00:00:00.0000000
Name: TGL_REKAM_PERTAMA, Length: 676, dtype: object

In [16]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0      2012-12-24
1      2007-12-31
2      2007-04-16
3      2007-12-31
4      2007-12-31
          ...
671    2010-03-10
672    2007-12-31
673    2010-03-10
674    2007-12-31
675    2010-03-10
Name: TGL_REKAM_PERTAMA, Length: 676, dtype: object

In [17]:
df[cname[4]]

0      2012-10-22 00:00:00.0000000
1                              NaN
2                              NaN
3                              NaN
4                              NaN
                  ...
671                            NaN
672                            NaN
673                            NaN
674                            NaN
675                            NaN
Name: TGL_DANA, Length: 676, dtype: object

In [18]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0      2012-10-22
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
671    0000-00-00
672    0000-00-00
673    0000-00-00
674    0000-00-00
675    0000-00-00
Name: TGL_DANA, Length: 676, dtype: object

In [19]:
df[cname[5]]

0      2012-10-28 00:00:00.0000000
1      1987-01-02 00:00:00.0000000
2      2003-03-02 00:00:00.0000000
3      1995-10-20 00:00:00.0000000
4      1985-08-24 00:00:00.0000000
                  ...
671    1980-12-31 00:00:00.0000000
672    1989-10-18 00:00:00.0000000
673    1980-12-31 00:00:00.0000000
674    1995-10-20 00:00:00.0000000
675    1980-12-31 00:00:00.0000000
Name: TGL_PERLH, Length: 676, dtype: object

In [20]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0      2012-10-28
1      1987-01-02
2      2003-03-02
3      1995-10-20
4      1985-08-24
          ...
671    1980-12-31
672    1989-10-18
673    1980-12-31
674    1995-10-20
675    1980-12-31
Name: TGL_PERLH, Length: 676, dtype: object

In [21]:
df[cname[6]]

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
      ...
671    NaN
672    NaN
673    NaN
674    NaN
675    NaN
Name: TGL_PSP, Length: 676, dtype: object

In [22]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0      0000-00-00
1      0000-00-00
2      0000-00-00
3      0000-00-00
4      0000-00-00
          ...
671    0000-00-00
672    0000-00-00
673    0000-00-00
674    0000-00-00
675    0000-00-00
Name: TGL_PSP, Length: 676, dtype: object

In [59]:
df[cname[7]]

0      20200226
1      20200226
2      20200226
3      20200226
4      20200226
         ...
671    20200226
672    20200226
673    20200226
674    20200226
675    20200226
Name: TGL_TARIK, Length: 676, dtype: int64

In [24]:
data = df
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0      2020-02-26
1      2020-02-26
2      2020-02-26
3      2020-02-26
4      2020-02-26
          ...
671    2020-02-26
672    2020-02-26
673    2020-02-26
674    2020-02-26
675    2020-02-26
Name: TGL_TARIK, Length: 676, dtype: object

In [27]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [28]:
df.to_sql('t_ASET_BANGUNAN_AIR', con=engine, if_exists='append', chunksize=500, index=False)